index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-01-15 Sat 14:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Short Selling Stock</title>
<meta name="author" content="Matt Brigida, Ph.D." />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Short Selling Stock</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org865df68">1. Why Short Stock?</a></li>
<li><a href="#org7512ab5">2. So How Does It Work?</a></li>
<li><a href="#org7ab84cb">3. Example Profit/Loss</a></li>
<li><a href="#org3be1e18">4. Example Profit/Loss</a></li>
<li><a href="#org7a0d9c7">5. Interactive App</a></li>
<li><a href="#org107e53a">6. How Do You Borrow Shares?</a></li>
<li><a href="#orgcd58245">7. Naked Shorting</a></li>
<li><a href="#org7364603">8. Alternatives to Shorting: Inverse ETFs</a></li>
<li><a href="#orgb6140a5">9. Inverse ETF Performance</a></li>
<li><a href="#org04124a5">10. S&amp;P 500 (SPY) and Short S&amp;P 500 (SH)</a></li>
<li><a href="#org6300f04">11. Does Shorting Create Shares?</a></li>
</ul>
</div>
</div>


<div id="outline-container-org865df68" class="outline-2">
<h2 id="org865df68"><span class="section-number-2">1.</span> Why Short Stock?</h2>
<div class="outline-text-2" id="text-1">
<p>
By shorting stock we profit when the stock price declines.  So you can use short sales to speculate.
</p>

<p>
However, shorting stock is also used by banks to hedge put options they have sold, as well as other derivative positions.
</p>

<p>
In other words, shorting stock is used to lessen the risk taken by banks and other financial intermediaries.  In fact, without the ability to short, put options and other derivatives may not exist. 
</p>
</div>
</div>



<div id="outline-container-org7512ab5" class="outline-2">
<h2 id="org7512ab5"><span class="section-number-2">2.</span> So How Does It Work?</h2>
<div class="outline-text-2" id="text-2">
<p>
To short a share of stock, you borrow the stock from someone (say, Bob) and sell it to someone else (say, Sandra).  Say that you sold it to Sandra for \$100.  The cash balance in your account will increase by \$100, and you will hold a -1 position in the stock.  
</p>

<ul class="org-ul">
<li>Eventually, you'll have to return the stock to Bob to close our your short position.</li>

<li>To return the stock to Bob, you'll go to the market and buy a share.  You can buy it from anyone, not just Sandra.</li>
</ul>
</div>
</div>



<div id="outline-container-org7ab84cb" class="outline-2">
<h2 id="org7ab84cb"><span class="section-number-2">3.</span> Example Profit/Loss</h2>
<div class="outline-text-2" id="text-3">
<p>
Imagine that the stock is trading in the market for \$80 when you decide to close the position.
</p>

<ul class="org-ul">
<li>To close the postion, you buy the stock for \$80 and return it to Bob.</li>

<li>After the transaction you are left with a profit of \$100 - \$80 = \$20.</li>
</ul>
</div>
</div>



<div id="outline-container-org3be1e18" class="outline-2">
<h2 id="org3be1e18"><span class="section-number-2">4.</span> Example Profit/Loss</h2>
<div class="outline-text-2" id="text-4">
<p>
Alternatievly, say the stock is trading in the market for \$110 when you decide to close the position.
</p>

<ul class="org-ul">
<li>To close the postion, you buy the stock for \$110 and return it to Bob.</li>

<li>So you sold the stock for \$100, and bought it for \$110, for a loss of \$10.</li>
</ul>
</div>
</div>



<div id="outline-container-org7a0d9c7" class="outline-2">
<h2 id="org7a0d9c7"><span class="section-number-2">5.</span> Interactive App</h2>
<div class="outline-text-2" id="text-5">
<p>
On the next slide you can input the amount of shares you want to short, as well as the prices at which you open and close the short position.
</p>

<ul class="org-ul">
<li>The app shows each transaction made in the course of the short sale and also your ultimate profit.</li>

<li>A negative profit is a loss.</li>

<li>Complete lines open the short position, and dotted lines close the short.</li>
</ul>


<script>
var calculate = function() {

  var pp = Number(document.getElementById("pp").value);
  var n = Number(document.getElementById("n").value);
  var im = Number(document.getElementById("im").value);
  var cp = Number(document.getElementById("cp").value);
  
  var loan = pp * n * (1 - im);
  var new_margin = 100 * (cp * n - loan) / (cp * n);
  
  document.getElementById("out_new_margin").innerHTML = new_margin.toFixed(2);

}
</script>


<body class="all">
  <h3>
    Long Margin Percent Calculator
  </h3>

  <div class="row">

    <div class="column">
      <table style="width:100%">
        <tr>
          <th align="left">Purchase Price:</th>
          <th><input id="pp" value="100" style="width: 50px"></th>
        </tr>
        <tr>
          <th align="left">Number of Shares:</th>
          <th><input id="n" value="100" style="width: 50px"></th>
        </tr>
        <tr>
          <th align="left">Initial Margin:</th>
          <th><input id="im" value="0.6" style="width: 50px"></th>
        </tr>
        <tr>
          <th align="left">Current Price:</th>
          <th><input id="cp" value="70" style="width: 50px"></th>
        </tr>
      </table>
      <button onclick="calculate()">
        Calculate.
      </button>
    </div>

    <div class="column">
    <p><b>Current Margin: <span id="out_new_margin"></span>%</b></p>
    </div>

  </div>
  <br>
  <br>
  <br>
</body>
</div>
</div>


<div id="outline-container-org107e53a" class="outline-2">
<h2 id="org107e53a"><span class="section-number-2">6.</span> How Do You Borrow Shares?</h2>
<div class="outline-text-2" id="text-6">
<p>
This is handled by your broker &#x2013; you don't have to worry about the mechanics behind the scenes.
</p>

<ul class="org-ul">
<li>Essentially what happens is you broker will borrow the shares from a large investor or mutual fund.</li>

<li>Sometimes your broker doesn't think it will be able to borrow shares, and will indicate the stock is not available for shorting.</li>

<li>Note, you don't have any sort of right to short, and so during times of market turbulence, you may not be able to short many stocks.</li>
</ul>
</div>
</div>



<div id="outline-container-orgcd58245" class="outline-2">
<h2 id="orgcd58245"><span class="section-number-2">7.</span> Naked Shorting</h2>
<div class="outline-text-2" id="text-7">
<p>
Your broker has some leeway in terms of how soon they have to borrow shares &#x2013; generally, a few days.
</p>

<ul class="org-ul">
<li>In the past, however, some brokers never bothered to borrow the shares.</li>

<li>The term for shorting while failing to borrow the stock is 'Naked Shorting' and it has been banned by the U.S. Securities and Exchange Commission.</li>
</ul>
</div>
</div>



<div id="outline-container-org7364603" class="outline-2">
<h2 id="org7364603"><span class="section-number-2">8.</span> Alternatives to Shorting: Inverse ETFs</h2>
<div class="outline-text-2" id="text-8">
<p>
If you don't want to short (or your brokerage account doesn't allow it), you can simply buy an inverse [Exchange Traded Fund (ETF)](<a href="http://www.5minutefinance.org/concepts/exchange-traded-funds">http://www.5minutefinance.org/concepts/exchange-traded-funds</a>).
</p>

<ul class="org-ul">
<li>Buying an inverse ETF on a portfolio will afford a return very similar to shorting the portfolio.</li>

<li>Inverse ETFs are not available for individual stocks.</li>
</ul>
</div>
</div>



<div id="outline-container-orgb6140a5" class="outline-2">
<h2 id="orgb6140a5"><span class="section-number-2">9.</span> Inverse ETF Performance</h2>
<div class="outline-text-2" id="text-9">
<p>
The next slide shows the performance of an ETF on the S&amp;P 500 (SPY) and an inverse ETF on the S&amp;P 500 (SH).
</p>

<ul class="org-ul">
<li>To zoom in or focus on a subinterval, use the range selector at the bottom of the chart.</li>

<li>You can see the inverse ETF (short) is a mirror image of the performance of the S&amp;P 500.</li>
</ul>
</div>
</div>



<div id="outline-container-org04124a5" class="outline-2">
<h2 id="org04124a5"><span class="section-number-2">10.</span> S&amp;P 500 (SPY) and Short S&amp;P 500 (SH)</h2>
<div class="outline-text-2" id="text-10">
<p>
```{r, echo=FALSE, message=FALSE, warning=FALSE}
#{{{
library(dygraphs)
devtools::install<sub>github</sub>("joshuaulrich/quantmod", ref="157<sub>yahoo</sub><sub>502</sub>")
library(quantmod)
renderDygraph({
    stock1 &lt;- getSymbols("SPY", from = "1950-01-03", auto.assign = FALSE)
    stock2 &lt;- getSymbols("SH", from = "1950-01-03", auto.assign = FALSE)
    stocks &lt;- merge.xts(Ad(stock1), Ad(stock2), join = "inner")
    dygraph(Ad(stocks), main = "") %&gt;%
        dyRangeSelector()
})
#}}}
```
</p>




<p>
&lt;!&#x2014;
</p>
</div>
</div>
<div id="outline-container-org6300f04" class="outline-2">
<h2 id="org6300f04"><span class="section-number-2">11.</span> Does Shorting Create Shares?</h2>
<div class="outline-text-2" id="text-11">
<p>
Short answer: No.
</p>

<p>
In our example, Bob ownes a share, we <b>owe</b> one share, and Sandra ownes a share.  The number of shares outstanding are 1 - 1 + 1 = 1.
</p>

<ul class="org-ul">
<li>So as long as the shares are actually borrowed (it is not a naked short), shorting has no effect on the float.</li>
</ul>
<p>
&#x2013;&gt;
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Matt Brigida, Ph.D.</p>
<p class="date">Created: 2022-01-15 Sat 14:14</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
